## IMPORT PACKAGE

- pandas

In [1]:
import pandas as pd

## FILE RECORD CSV

In [2]:
ds = pd.read_csv("charts.csv")

In [3]:
ds

,date,rank,song,artist,last-week,peak-rank,weeks-on-board
0,2021-11-06,1,Easy On Me,Adele,1.0,1,3
1,2021-11-06,2,Stay,The Kid LAROI & Justin Bieber,2.0,1,16
2,2021-11-06,3,Industry Baby,Lil Nas X & Jack Harlow,3.0,1,14
3,2021-11-06,4,Fancy Like,Walker Hayes,4.0,3,19
4,2021-11-06,5,Bad Habits,Ed Sheeran,5.0,2,18
...,...,...,...,...,...,...,...
330082,1958-08-04,96,Over And Over,Thurston Harris,NaN,96,1
330083,1958-08-04,97,I Believe In You,Robert & Johnny,NaN,97,1
330084,1958-08-04,98,Little Serenade,The Ames Brothers,NaN,98,1
330085,1958-08-04,99,I'll Get By (As Long As I Have You),Billy Williams,NaN,99,1
330086,1958-08-04,100,Judy,Frankie Vaughan,NaN,100,1

## Menampilkan Informasi Jumlah Record, Nama Attribute, Jumlah Attribute dengan tipe Objek, jumlah Attribute dengan tipe Angka, dan jumlah Attribute yang memiliki nilai Null dengan memasukkannya kedalam Dictionary dengan Key sesuai nama informasinya.

In [4]:
isiRecord = len(ds)
attribut = ds.columns
objek = len(ds.select_dtypes(include=['object']).columns)
float = len(ds.select_dtypes(include=['float64']).columns)
angka = len(ds.select_dtypes(include=['int64']).columns)
null = len(ds.columns[ds.isna().sum() > 0])

dictionary = {
    "Isi Record      :": isiRecord,
    "Nama Attribut   :": attribut,
    "Jumlah Attribut :": objek,
    "Jumlah Float    :": float,
    "Jumlah Angka    :": angka,
    "Jumlah Null     :": null,
}

pd.Series(dictionary)

Isi Record      :                                               330087
Nama Attribut   :    Index(['date', 'rank', 'song', 'artist', 'last...
Jumlah Attribut :                                                    3
Jumlah Float    :                                                    1
Jumlah Angka    :                                                    3
Jumlah Null     :                                                    1
dtype: object

## Menampilkan Rata-Rata, Standar Deviasi, Nilai Minimum, Nilai Maksimum, Q1, Q2, dan Q3 dari attribute bertipe Angka.

In [5]:
ds.describe()

                rank      last-week      peak-rank  weeks-on-board
count  330087.000000  297775.000000  330087.000000   330087.000000
mean       50.500929      47.591631      40.970629        9.161785
std        28.866094      28.054360      29.347481        7.618264
min         1.000000       1.000000       1.000000        1.000000
25%        26.000000      23.000000      13.000000        4.000000
50%        51.000000      47.000000      38.000000        7.000000
75%        76.000000      72.000000      65.000000       13.000000
max       100.000000     100.000000     100.000000       90.000000

RATA-RATA

In [6]:
ds.select_dtypes(include=['int64']).mean()

rank              50.500929
peak-rank         40.970629
weeks-on-board     9.161785
dtype: float64

In [7]:
ds.select_dtypes(include=['float64']).mean()

last-week    47.591631
dtype: float64

STANDAR DEVIASI

In [8]:
ds.select_dtypes(include=['int64']).std()

rank              28.866094
peak-rank         29.347481
weeks-on-board     7.618264
dtype: float64

In [9]:
ds.select_dtypes(include=['float64']).std()

last-week    28.05436
dtype: float64

NILAI MINIMUM

In [10]:
ds.select_dtypes(include=['int64']).min()

rank              1
peak-rank         1
weeks-on-board    1
dtype: int64

In [11]:
ds.select_dtypes(include=['float64']).min()

last-week    1.0
dtype: float64

NILAI MAKSIMUM

In [12]:
ds.select_dtypes(include=['int64']).max()

rank              100
peak-rank         100
weeks-on-board     90
dtype: int64

In [13]:
ds.select_dtypes(include=['float64']).max()

last-week    100.0
dtype: float64

NILAI KUARTIL(Q1, Q2, dan Q3)

In [14]:
ds.select_dtypes(include=['int64']).quantile([0.25,0.5,0.75])

      rank  peak-rank  weeks-on-board
0.25  26.0       13.0             4.0
0.50  51.0       38.0             7.0
0.75  76.0       65.0            13.0

In [15]:
ds.select_dtypes(include=['float64']).quantile([0.25,0.5,0.75])

      last-week
0.25       23.0
0.50       47.0
0.75       72.0

## MENAMPILKAN NILAI KORELASI

In [16]:
ds.select_dtypes(include=['int64']).corr()

                    rank  peak-rank  weeks-on-board
rank            1.000000   0.822937       -0.327456
peak-rank       0.822937   1.000000       -0.606917
weeks-on-board -0.327456  -0.606917        1.000000

In [17]:
ds.select_dtypes(include=['float64']).corr()

           last-week
last-week        1.0

## MERUBAH NILAI BILANGAN MENJADI NILAI DESIMAL(3 ANGKA DIBELAKANG KOMA)/SEBALIKNYA

Attribut Rank

In [18]:
pd.options.display.float_format = '{:.3f}'.format
ds['rank'].astype('float64')

0          1.000
1          2.000
2          3.000
3          4.000
4          5.000
           ...
330082    96.000
330083    97.000
330084    98.000
330085    99.000
330086   100.000
Name: rank, Length: 330087, dtype: float64

Attribut Peak-Rank

In [19]:
pd.options.display.float_format = '{:.3f}'.format
ds['peak-rank'].astype('float64')

0          1.000
1          1.000
2          1.000
3          3.000
4          2.000
           ...
330082    96.000
330083    97.000
330084    98.000
330085    99.000
330086   100.000
Name: peak-rank, Length: 330087, dtype: float64

Attribut Weeks-On-Board

In [20]:
pd.options.display.float_format = '{:.3f}'.format
ds['weeks-on-board'].astype('float64')

0         3.000
1        16.000
2        14.000
3        19.000
4        18.000
          ...
330082    1.000
330083    1.000
330084    1.000
330085    1.000
330086    1.000
Name: weeks-on-board, Length: 330087, dtype: float64

Attribut Last-Week

In [21]:
pd.options.display.float_format = '{0:}'.format
ds['weeks-on-board'].astype('int64')

0          3
1         16
2         14
3         19
4         18
          ..
330082     1
330083     1
330084     1
330085     1
330086     1
Name: weeks-on-board, Length: 330087, dtype: int64

## MENAMPILKAN 10 RECORD PERTAMA DARI ATTRIBUT BERTIPE ANGKA

In [22]:
columns_dtypes_info = ds.dtypes

In [23]:
dataset_columns = ds.columns

In [24]:
dataset_columns_int = []
for index, item in enumerate(columns_dtypes_info):
    if str (item) == 'int64':
        dataset_columns_int.append(dataset_columns[index])
        
print(dataset_columns_int)

['rank', 'peak-rank', 'weeks-on-board']

In [25]:
ds[dataset_columns_int].head(10)

   rank  peak-rank  weeks-on-board
0     1          1               3
1     2          1              16
2     3          1              14
3     4          3              19
4     5          2              18
5     6          1               8
6     7          7               7
7     8          1              24
8     9          9              20
9    10          2              56

In [26]:
dataset_columns_float = []
for index, item in enumerate(columns_dtypes_info):
    if str (item) == 'float64':
        dataset_columns_float.append(dataset_columns[index])
        
print(dataset_columns_float)

['last-week']

In [27]:
ds[dataset_columns_float].head(10)

   last-week
0        1.0
1        2.0
2        3.0
3        4.0
4        5.0
5        6.0
6        9.0
7        7.0
8       11.0
9        8.0